---
kind: type
id: T:Autodesk.Revit.DB.BRepType
source: html/7006d069-f606-c27a-8c77-30cbdbc263d1.htm
---
# Autodesk.Revit.DB.BRepType

This class defines an enumerative type used to specify the type of output geometry expected from a BRepBuilder.

## Syntax (C#)
```csharp
public enum BRepType
```